#include "LED.h"
#include "ti/driverlib/dl_gpio.h"


//-------------------------------------------------------------------------------------------------------------------
// @brief       点亮所有灯
// @param       void
// @return      void
//-------------------------------------------------------------------------------------------------------------------
void LED0_ON(void)
{
	DL_GPIO_setPins(GPIOB, DL_GPIO_PIN_22);
	DL_GPIO_setPins(GPIOB, DL_GPIO_PIN_26);
	DL_GPIO_setPins(GPIOB, DL_GPIO_PIN_27);
}
//-------------------------------------------------------------------------------------------------------------------
// @brief       点灭所有灯
// @param       void
// @return      void
//-------------------------------------------------------------------------------------------------------------------
void LED0_OFF(void)
{
	DL_GPIO_clearPins(GPIOB, DL_GPIO_PIN_22);
	DL_GPIO_clearPins(GPIOB, DL_GPIO_PIN_26);
	DL_GPIO_clearPins(GPIOB, DL_GPIO_PIN_27);
}

//-------------------------------------------------------------------------------------------------------------------
// @brief       所有灯周期闪烁
// @param       闪烁周期 单位：ms
// @return      void
//-------------------------------------------------------------------------------------------------------------------

void LED_bling(uint32_t ms)
{
	LED0_ON();
	delay_ms(500);
	LED0_OFF();
	delay_ms(500);
	}
